# Область Excel 

//!!! Пример вызова на форме  !!!

//&НаКлиенте
//Процедура ЗагрузитьИзExcel(Команда)
//	
//	ИД = КлиентСерверный.ЗагрузитьИзXLS("МакетОПТМ");
//	
//	Если ЗначениеЗаполнено(ИД)  Тогда
//		ЗагрузкаНаСервере(ИД);
//	КонецЕсли; 
//	
//КонецПроцедуры

//&НаСервере
//Процедура ЗагрузкаНаСервере(ИД)	
//	ТЗ = ПолучитьИзВременногоХранилища(ИД);
//КонецПроцедуры

&НаКлиенте
Функция ЗагрузитьИзXLS(СоответствиеКолонок, НазваниеЛиста = "", НомерПервойСтроки = 1) Экспорт 
	
	ИД 	= Серверный.ПоместитьЗаглушку(СоответствиеКолонок);
	
	ДиалогВыбораФайла 							= Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.Фильтр 					= "Документ Excel (*.xls, *.xlsx)|*.xls;*.xlsx|"; 
	ДиалогВыбораФайла.Заголовок 				= "Выберите файл";
	ДиалогВыбораФайла.ПредварительныйПросмотр 	= Ложь;
	ДиалогВыбораФайла.МножественныйВыбор 		= Ложь;
	ДиалогВыбораФайла.ИндексФильтра 			= 0;
	
	Параметры 			= Новый Структура("Макет,АдресХр,НазваниеЛиста,НомерПервойСтроки", СоответствиеКолонок, ИД, НазваниеЛиста, НомерПервойСтроки);
	//ОписаниеОповещения 	= Новый ОписаниеОповещения("ЗагрузитьФайлЗавершение", ЭтотОбъект, Параметры);
	//НачатьПомещениеФайла(ОписаниеОповещения,,ДиалогВыбораФайла,Истина);
	
	Если ДиалогВыбораФайла.Выбрать() Тогда
		ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ДиалогВыбораФайла.ПолноеИмяФайла), ИД);
		ЗагрузитьФайлЗавершение(Истина, Ид, ДиалогВыбораФайла.ПолноеИмяФайла, Параметры);
	КонецЕсли;
	
	Возврат ИД;
	
КонецФункции

Процедура ЗагрузитьФайлЗавершение(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
	
	ИмяФайла = 	Прав(	ВыбранноеИмяФайла,
						СтрДлина(ВыбранноеИмяФайла) - СтрНайти(ВыбранноеИмяФайла, "\", НаправлениеПоиска.СКонца));
						
	Если Не Адрес = "" Тогда
		Серверный.ФормированиеТаблицы(Адрес, ИмяФайла, ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

# КонецОбласти 
